app/views/articles/_form.html.haml

      .form-group
        = form.collection_select :category_id, Category.all, :id, :name, {prompt: 'Choose a Category'}, class: "form-control"
  .row
    .col-lg-10
      .form-group
---
SELECT `categories`.* FROM `categories`