app/controllers/articles_controller.rb

  def index
    if params[:category].blank?
      get_all_articles
    else
      @category_id = Category.find_by(name: params[:category]).id
---
SELECT `categories`.* FROM `categories`
SELECT  `categories`.* FROM `categories` WHERE `categories`.`name` = 'Art' LIMIT 1

  def create
    @article = current_user.articles.build(article_params)

    if @article.save
---
INSERT INTO `articles` (`title`, `content`, `user_id`, `created_at`, `updated_at`) VALUES ('Too Good', 'Chambray authentic bushwick skateboard raw denim, hella lyft readymade meh lo-fi tilde. PBR&B vape bitters pop-up mustache austin. Cred activated charcoal listicle plaid, pug af intelligentsia before they sold out jean shorts man bun. Jianbing fashion axe hoodie hot chicken YOLO, activated charcoal pop-up DIY migas chambray pabst direct trade. Leggings dreamcatcher messenger bag brunch, live-edge mixtape heirloom humblebrag austin. Tumeric post-ironic bespoke, air plant shoreditch normcore jianbing everyday carry. Hell of tote bag cardigan iceland, master cleanse readymade banh mi selfies VHS iPhone gluten-free bitters.', 1, '2016-11-15 12:01:46', '2016-11-15 12:01:46')

  def update
    if @article.update(article_params)
---
UPDATE `articles` SET `content` = 'Test cricket is as much about execution of tactics as much as it is about planning. It allows teams the luxury of switching plans midway. In blunting 35 overs for a little over one run per over after restricting their first-innings deficit to 67, Pakistan ensured the new-ball storm was weathered. But their crawl allowed New Zealand to take the edge when they came out with renewed verve after tea on a bright and sunny day in Christchurch.', `updated_at` = '2016-11-19 15:50:36' WHERE `articles`.`id` = 5

  def find_article
    @article = Article.find(params[:id])
---
SELECT `articles`.* FROM `articles` WHERE `articles`.`id` = 1  ORDER BY created_at DESC